Documents/ЗакрытиеМесяца_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца_</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УдалитьТоварыВНТТВПродажныхЦенахНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОС</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьНМА</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВНТТВПродажныхЦенах</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияКосвенныхРасходовУправленческийУчет</xr:Item>
				<xr:Item>InformationRegister.ПорядокЗакрытияПодразделенийОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ДугиКорректировкиСтоимостиСписания</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПриобретенияНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиНалоговыхНазначенийТЗР</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПодотчетнымиЛицами</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПродажиНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасчетСписанияРБП</xr:Item>
				<xr:Item>AccumulationRegister.ПриобретенияНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияКосвенныхРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВРазрезеГарантийныхСроковНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровПереданныеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>InformationRegister.УзлыКорректировкиСтоимостиСписания</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимостиПродукцици</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровНаСкладахНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.БракВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ДопРасходыНаПриобретениеТоваров</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимостиПродукцииУправленческийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗатратОПРНаОсновноеПроизводство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ЗакрытиеМесяца_/Ext/ObjectModule.bsl
Перем мНачМесяца;
Перем мКонМесяца;
Перем мНачКвартала;
Перем мКонКвартала;
Перем мНачГода;
Перем мНачГраница;
Перем мКонГраница;

Перем мКонКварталаВключая;

Перем мУчетнаяПолитикаУУ;
Перем мУчетнаяПолитикаБУ;
Перем мУчетнаяПолитикаНУ;
Перем мПараметрыНалоговогоУчета;

Перем мОперация;
Перем мПроводкиБУ;

Перем мПоказателиНормальнойМощности;

Перем ПорядокПодразделенийСообщался;
Перем ПорядокПеределовСообщался;

Перем ТаблицаНеЗакрытыхПодразделений;
Перем ТаблицаНеЗакрытыхПодразделенийУпр;

Перем ПорядокПеределов;

Перем мКоэффициентМатериальнойСоставляющей;
Перем мКоэффициентМатериальнойСоставляющейРассчитан;

Перем мВалютаРегламентированногоУчета;

Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	
	// СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей = Новый Структура();

	// Вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ(СтруктураШапкиДокумента, Отказ, Заголовок, НаборЗаписей)
	
	Если СтруктураШапкиДокумента.КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ Тогда
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток,
			|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток,
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.Субконто1,
			|	ХозрасчетныйОстаткиИОбороты.Субконто2,
			|	ХозрасчетныйОстаткиИОбороты.Субконто3,
			|	ХозрасчетныйОстаткиИОбороты.Субконто4,
			|	ХозрасчетныйОстаткиИОбороты.Организация,
			|	ХозрасчетныйОстаткиИОбороты.Валюта,
			|	ХозрасчетныйОстаткиИОбороты.НалоговоеНазначение,
			|	ХозрасчетныйОстаткиИОбороты.Счет
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Месяц,
			|			,
			|			Счет В ИЕРАРХИИ (&Счета),
			|			,
			|			Организация = &Организация
			|				И ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Документ.КомплектацияНоменклатуры)
			|				И Субконто2 = &Склад) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток > 0
			|	И ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток >= 0";
		
		Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(Дата),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация); 
		Запрос.УстановитьПараметр("Склад", Константы.umk_СкладПродукции.Получить());
		Запрос.УстановитьПараметр("Счета", МассивСчетов);
		
		РезультатЗапроса = Запрос.Выполнить();
		                                             
		Выборка = РезультатЗапроса.Выбрать();
			
		
		Пока Выборка.Следующий() Цикл
			
			ПроводкаБУ = НаборЗаписей.Добавить();
			ПроводкаБУ.Организация = Выборка.Организация;
			ПроводкаБУ.НалоговоеНазначениеКт = Выборка.НалоговоеНазначение;
			ПроводкаБУ.ВалютаДт = Выборка.Валюта;
			ПроводкаБУ.ВалютаКт = Выборка.Валюта;
			ПроводкаБУ.Содержание = "Корректировка списания себестоимости комплектов";
			ПроводкаБУ.Период = КонецМесяца(Дата)-1;
			ПроводкаБУ.Регистратор = Ссылка;
			
			Если Выборка.КоличествоКонечныйОстаток = 0 // Тогда спишем на с/с реализации всю сумму 
				Тогда
				ПроводкаБУ.Сумма =  Выборка.СуммаКонечныйОстаток;
			ИначеЕсли Выборка.КоличествоКонечныйОстаток > 0 Тогда// Откорректируем сумму остатка
				СтоимостьЕд = ?(Выборка.КоличествоОборотДт = 0, 0, Выборка.СуммаОборотДт/Выборка.КоличествоОборотДт);
				СуммаДолжнаОстаться = СтоимостьЕд * Выборка.КоличествоКонечныйОстаток;
				Если НЕ СуммаДолжнаОстаться = 0
					Тогда ПроводкаБУ.Сумма =  Выборка.СуммаКонечныйОстаток - СуммаДолжнаОстаться;
				КонецЕсли;
			КонецЕсли;
			
			ПроводкаБУ.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойГотовойПродукции;
			
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, Выборка.Субконто1.НоменклатурнаяГруппаЗатрат);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 2, Справочники.СтатьиЗатрат.НПНК_СВ_ПродукцияУслуги);
			
			ПроводкаБУ.СчетКт = Выборка.счет;
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 1, Выборка.Субконто1);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 2,  Выборка.Субконто2);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 3,  Выборка.Субконто3);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 4,  Выборка.Субконто4);
			
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура КорректировкаЗатратОПРНаОсновноеПроизводство(СтруктураШапкиДокумента, Отказ, Заголовок, НаборЗаписей)
	
	ОсновноеПодразделение = Константы.umk_ОсновноеПодразделениеОрганизации.Получить();
	
	Если Не ЗначениеЗаполнено(ОсновноеПодразделение) Тогда
		
		#Если Клиент Тогда
			
			Сообщить("Не установлено основное подразделение (Константы УМК)", СтатусСообщения.Важное);
			
		#КонецЕсли
		    Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	 
	Если СтруктураШапкиДокумента.КорректировкаЗатратОПРНаОсновноеПроизводство
		Тогда
		
		Сч_91 = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы;
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(Сч_91);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОбороты.Субконто1,
			|	ХозрасчетныйОбороты.Субконто2,
			|	ХозрасчетныйОбороты.Субконто3,
			|	ХозрасчетныйОбороты.Субконто4,
			|	ХозрасчетныйОбороты.Организация,
			|	ХозрасчетныйОбороты.Валюта,
			|	ХозрасчетныйОбороты.НалоговоеНазначение,
			|	ХозрасчетныйОбороты.Счет,
			|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Месяц,
			|			Счет В ИЕРАРХИИ (&Счета),
			|			,
			|			Организация = &Организация
			|				И НЕ Субконто1 = &Подразделение,
			|			,
			|			) КАК ХозрасчетныйОбороты";
		
		Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(Дата),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация); 
		Запрос.УстановитьПараметр("Подразделение", ОсновноеПодразделение);
		Запрос.УстановитьПараметр("Счета", МассивСчетов);
		
		РезультатЗапроса = Запрос.Выполнить();
		                                             
		Выборка = РезультатЗапроса.Выбрать();
		

		Пока Выборка.Следующий() Цикл
			
			ПроводкаБУ = НаборЗаписей.Добавить();
			ПроводкаБУ.Организация = Выборка.Организация;
			ПроводкаБУ.НалоговоеНазначениеКт = Выборка.НалоговоеНазначение;
			ПроводкаБУ.ВалютаДт = Выборка.Валюта;
			ПроводкаБУ.ВалютаКт = Выборка.Валюта;
			ПроводкаБУ.Содержание = "Корректировка затрат сч. 91 на Основное подразделение";
			ПроводкаБУ.Период = КонецМесяца(Дата)-1;
			ПроводкаБУ.Регистратор = Ссылка;
			ПроводкаБУ.Сумма =  Выборка.Сумма;
						
			ПроводкаБУ.СчетДт = Сч_91;
			
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 1, ОсновноеПодразделение);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 2, Выборка.Субконто2);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, 3, Выборка.Субконто3);
			
			ПроводкаБУ.СчетКт = Сч_91;
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 1, Выборка.Субконто1);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 2, Выборка.Субконто2);
			ОбщегоНазначения.УстановитьСубконто(ПроводкаБУ.СчетКт, ПроводкаБУ.СубконтоКт, 3, Выборка.Субконто3);
			
		
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция РазностьДатВДнях(Дата1, Дата2)

	мДлинаСуток = 86400; // в секундах

	Возврат Окр((НачалоДня(Дата2) - НачалоДня(Дата1)) / мДлинаСуток);

КонецФункции

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
	
		ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок);	
		
	Иначе	
		
		ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;
	
	
	//КОРРЕКТИРОВКА 91СЧ. НА ОСНОВНОЕ ПРОИЗВОДСТВО
	КорректировкаЗатратОПРНаОсновноеПроизводство(СтруктураШапкиДокумента, Отказ, Заголовок, НаборЗаписей);
		
	// СЕБЕСТОИМОСТЬ РЕАЛИЗАЦИИ БУ
	КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ(СтруктураШапкиДокумента, Отказ, Заголовок, НаборЗаписей);
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАСПРЕДЕЛЕНИЮ ТЗР 


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
 	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШапкиДокумента.Вставить("ОтражатьВУправленческомУчете",   Ложь);
	СтруктураШапкиДокумента.Вставить("ОтражатьВБухгалтерскомУчете",    Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль",    ОбщегоНазначения.ПолучитьСхемуНалогообложения(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Организация).НалогНаПрибыль);
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015",ОбщегоНазначения.ПолучитьСхемуНалогообложения(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Организация).НалогНаПрибыль И (Дата < глЗначениеПеременной("ДатаНКУ2015")));
	СтруктураШапкиДокумента.Вставить("ЕстьНДС",    			  ОбщегоНазначения.ПолучитьСхемуНалогообложения(СтруктураШапкиДокумента.Дата, СтруктураШапкиДокумента.Организация).НДС);
	
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета",     "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// определим тип документа - закрытие периода по Упр. или Регл. учетам
	СтруктураШапкиДокумента.Вставить("ЭтоДокументЗакрытияМесяцаУпр", НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация));
	
	мНачМесяца    = НачалоМесяца(Дата);
	мКонМесяца    = Дата;
	мНачКвартала 	= НачалоКвартала(Дата);
	мКонКвартала 	= КонецКвартала(Дата);
	мНачГода    	= НачалоГода(Дата);
	мНачГраница = Новый Граница(мНачМесяца, ВидГраницы.Включая);
	мКонГраница = Новый Граница(мКонМесяца, ВидГраницы.Включая);
	
	мКонКварталаВключая = Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая);
		
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект));
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Отказ Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
		мУчетнаяПолитикаБУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, СтруктураШапкиДокумента.Организация, "Бух");
		мУчетнаяПолитикаНУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, СтруктураШапкиДокумента.Организация, "Нал");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		мПараметрыНалоговогоУчета	= УчетНДС.ПолучитьПараметрыНалоговогоУчета(мКонМесяца);
		СтруктураШапкиДокумента.Вставить("НеРаспределятьОПЗнаСебестоимостьПродукции", мУчетнаяПолитикаБУ.НеРаспределятьОПЗнаСебестоимостьПродукции);
		Если ЗначениеЗаполнено(мУчетнаяПолитикаНУ.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ) Тогда
			СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеНераспределенныхПостоянныхОПЗ", мУчетнаяПолитикаНУ.НалоговоеНазначениеНераспределенныхПостоянныхОПЗ);
		Иначе
			СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеНераспределенныхПостоянныхОПЗ", Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
		КонецЕсли;
		
		СтруктураШапкиДокумента.Вставить("ВключатьСуммуДооценокОСВСоставНП", мУчетнаяПолитикаБУ.ВключатьСуммуДооценокОСВСоставНП);
		
	Иначе
		мУчетнаяПолитикаУУ			= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонМесяца, Отказ, , "Упр");
		СтруктураШапкиДокумента.Вставить("НеРаспределятьОПЗнаСебестоимостьПродукцииВУУ", мУчетнаяПолитикаУУ.НеРаспределятьОПЗнаСебестоимостьПродукции);
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ЭтоДокументЗакрытияМесяцаУпр Тогда
	    СообщенияОповторахВидовОпераций = ПроверкаПовторовВидовОперацийУпр(СтруктураШапкиДокумента);
	Иначе	
		СообщенияОповторахВидовОпераций = ПроверкаПовторовВидовОперацийРегл(СтруктураШапкиДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщенияОповторахВидовОпераций) Тогда
		Сообщить(СообщенияОповторахВидовОпераций);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	мПроводкиБУ = Движения.Хозрасчетный;
		
		
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Функция ПроверкаПовторовВидовОперацийРегл(СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца", мНачМесяца);
	Запрос.УстановитьПараметр("КонецМесяца",  мКонМесяца);
	Запрос.УстановитьПараметр("НачалоКвартала", мНачКвартала);
	Запрос.УстановитьПараметр("КонецКвартала",  мКонКвартала);
	Запрос.УстановитьПараметр("Организация",  СтруктураШапкиДокумента.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца_.КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗакрытиеМесяца_.КорректировкаЗатратОПРНаОсновноеПроизводство = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КорректировкаЗатратОПРНаОсновноеПроизводство
	               |ИЗ
	               |	Документ.ЗакрытиеМесяца_ КАК ЗакрытиеМесяца_
	               |ГДЕ
	               |	ЗакрытиеМесяца_.Организация = &Организация
	               |	И ЗакрытиеМесяца_.Дата >= &НачалоМесяца
	               |	И ЗакрытиеМесяца_.Дата <= &КонецМесяца
	               |	И ЗакрытиеМесяца_.Проведен
	               |	И НЕ ЗакрытиеМесяца_.ПометкаУдаления";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТекстСообщения = "";
	
	Для Каждого Выборка Из Результат Цикл


        Если (Выборка.КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ > 1) И КорректировкаСебестоимостиРеализованнойПродукцииПоКомплектамБУ Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Корректировка себестоимости реализованной продукции по комплектам(БУ)"
"";
		КонецЕсли;
		
		 Если (Выборка.КорректировкаЗатратОПРНаОсновноеПроизводство > 1) И КорректировкаЗатратОПРНаОсновноеПроизводство Тогда
			ТекстСообщения = ТекстСообщения + "Повторение операции Корректировка затрат сч. БУ 91 на Основное производство"
"";
		КонецЕсли;


	КонецЦикла;

	Возврат ТекстСообщения;
	
Конецфункции

Функция ПроверкаПовторовВидовОперацийУпр(СтруктураШапкиДокумента)
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("НачалоМесяца", мНачМесяца);
	//Запрос.УстановитьПараметр("КонецМесяца",  мКонМесяца);
	//Запрос.УстановитьПараметр("НачалоКвартала", мНачКвартала);
	//Запрос.УстановитьПараметр("КонецКвартала",  мКонКвартала);
	//Запрос.УстановитьПараметр("Организация",  Справочники.Организации.ПустаяСсылка());
	//
	//Запрос.Текст = "";
	//			   
	//Результат = Запрос.Выполнить().Выгрузить();
	//
	//ТекстСообщения = "";
	//
	//Для Каждого Выборка Из Результат Цикл

	//	Если Выборка.  > 1 Тогда
	//		ТекстСообщения = ТекстСообщения + "Повторение операции .....";
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Возврат ТекстСообщения;
	
Конецфункции


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
